In [1]:
# !conda install --y xlrd

In [2]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [3]:

df = pd.read_excel("./data/excel-comp-data.xlsx")
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [4]:
# selection & drop

In [5]:
# selection with column names

In [6]:
df.head(2)

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000

In [7]:
df.head(2).T # 보기 편해서 많이 쓴다

                                      0                  1
account                          211829             320563
name         Kerluke, Koepp and Hilpert     Walter-Trantow
street               34456 Sean Highway  1311 Alvis Tunnel
city                         New Jaycob      Port Khadijah
state                             Texas      NorthCarolina
postal-code                       28752              38365
Jan                               10000              95000
Feb                               62000              45000
Mar                               35000              35000

In [8]:
df['account'].head(3) # 한개의 column 선택시 , Series 형태

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [9]:
df[["account", "street", "state"]].head(3) # 1개 이생의 column 선택

   account                                street          state
0   211829                    34456 Sean Highway          Texas
1   320563                     1311 Alvis Tunnel  NorthCarolina
2   648336  62184 Schamberger Underpass Apt. 231           Iowa

In [10]:
df[["account"]] # DataFrame 형태로 출력

    account
0    211829
1    320563
2    648336
3    109996
4    121213
5    132971
6    145068
7    205217
8    209744
9    212303
10   214098
11   231907
12   242368
13   268755
14   273274

In [11]:
# Selection with index number

In [12]:
# column 이름 없이 사용하는 index number 는 row 기준 표시
df[ :3] # index 숫자 기준으로

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000

In [13]:
# column 이름과 함께 row index 사용시, 해당 column 만
df["account"][:3]

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [14]:
account_series = df["account"]
account_series[:3]

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [15]:
account_series[[0, 1, 2]] # 1개 이상의 인덱스

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [16]:
account_series[account_series < 250000] # Boolean index, Ture 인 값만

0     211829
3     109996
4     121213
5     132971
6     145068
7     205217
8     209744
9     212303
10    214098
11    231907
12    242368
Name: account, dtype: int64

In [17]:
list(range(0, 15, 2))

[0, 2, 4, 6, 8, 10, 12, 14]

In [18]:
account_series[list(range(0, 15, 2))]

0     211829
2     648336
4     121213
6     145068
8     209744
10    214098
12    242368
14    273274
Name: account, dtype: int64

In [19]:
# index 변경
df.index = df["account"]

In [20]:
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,,
211829,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
109996,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [21]:
del df["account"]
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [22]:
# basic, loc, iloc, seleciton

In [23]:
# column 과 index number
df[["name", "street"]][:2]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [24]:
# column 과 index name
df.loc[[211829, 320563], ["name", "street"]] # location, index name, column

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [25]:
# column number 와 index number
df.iloc[:2, :2] # iloc

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [26]:
# index 재설정
df.index = list(range(0, 15))
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [27]:
df.reset_index() # drop=True 하면 기존 index 가 사라진다
# inplace = True : df 에 변경된 값이 들어간다

,index,name,street,city,state,postal-code,Jan,Feb,Mar
0,0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,6,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,7,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,8,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
9,9,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
10,10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
11,11,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
12,12,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
13,13,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
14,14,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

In [28]:
# data drop
df.drop(1).head() # index number 로 drop

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000

In [29]:
df.drop([0, 1, 2, 3]).head() # 여러개 삭제

,name,street,city,state,postal-code,Jan,Feb,Mar
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000

In [30]:
# axis 지정으로 축을 기준으로 drop -> column 중에 "city"
df.drop("city", axis=1).head() # df.drop(["city", "state"], axis=1)

,name,street,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,California,49681,162000,120000,35000

In [31]:
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [32]:
# dataframe operation

In [33]:
# series operaiton

In [34]:
s1 = Series(range(1, 6), index=list("abced"))
s1

a    1
b    2
c    3
e    4
d    5
dtype: int64

In [35]:
s2 = Series(range(5, 11), index=list("bcedef"))
s2

b     5
c     6
e     7
d     8
e     9
f    10
dtype: int64

In [36]:
s1.add(s2) # index 기준으로 연산 수행, 겹치는 index 가 없을 경우 NaN 으로 반환

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

In [37]:
s1 + s2

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

In [38]:
# dataframe operation

In [39]:
df1 = DataFrame(np.arange(9).reshape(3, 3), columns=list("abc"))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [40]:
df2 = DataFrame(np.arange(16).reshape(4, 4), columns=list("abcd"))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [41]:
# operation types : add, sub, div, mul

In [42]:
df1 + df2 # Df 는 column 과 index 를 모두 고려

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [43]:
df1.add(df2, fill_value=0) # fill_value = 0 하면 NaN 값을 0으로 변환

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

In [44]:
# series + dataframe

In [45]:
df = DataFrame(np.arange(16).reshape(4, 4), columns=list("abcd"))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [46]:
s2 = Series(np.arange(10, 14))
s2

0    10
1    11
2    12
3    13
dtype: int32

In [47]:
df + s2

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [48]:
df.add(s2, axis=0) # axis 를 기준으로 row broadcasting 실행

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

In [49]:
# lambda, map, apply

In [50]:
# map for series

# pandas 의 series type 의 데이터에도 map 함수 사용 가능
# funtion 대신 dict, sequence 형 자료등으로 대체 가능

In [51]:
s1 = Series(np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [52]:
s1.map(lambda x: x ** 2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [53]:
z = {1: 'A', 2: 'B', 3: 'C'}
s1.map(z).head(5) # dict type 으로 데이터 교체, 없는 값은 NaN

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object

In [54]:
s2 = Series(np.arange(10, 20))
s1.map(s2).head(5) # 같은 위치의 데이터를 s 로 전환

0    10
1    11
2    12
3    13
4    14
dtype: int32

In [55]:
df = pd.read_csv("./data/wages.csv")
df.head()

          earn  height     sex   race  ed  age
0  79571.29901   73.89    male  white  16   49
1  96396.98864   66.23  female  white  16   62
2  48710.66695   63.77  female  white  16   33
3  80478.09615   63.22  female  other  16   95
4  82089.34550   63.08  female  white  17   43

In [56]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [57]:
def change_sex(x):
    return 0 if x == "male" else 1

df.sex.map(change_sex)

0       0
1       1
2       1
3       1
4       1
       ..
1374    0
1375    1
1376    1
1377    0
1378    0
Name: sex, Length: 1379, dtype: int64

In [58]:
# str -> code
df["sex_code"] = df.sex.map({"male": 0, "female": 1})
df.head(5)

          earn  height     sex   race  ed  age  sex_code
0  79571.29901   73.89    male  white  16   49         0
1  96396.98864   66.23  female  white  16   62         1
2  48710.66695   63.77  female  white  16   33         1
3  80478.09615   63.22  female  other  16   95         1
4  82089.34550   63.08  female  white  17   43         1

In [59]:
# replace funtion

# map 함수 기능 중 데이터 변환 기능만 담당
# 데이터 변환 시 많이 사용하는 함수

In [60]:
df.sex.replace({"male": 0, "female": 1}).head()

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [61]:
# replace( Target list, Conversion list )
df.sex.replace(["male", "female"], [0, 1], inplace=True)
df.head(5)

          earn  height  sex   race  ed  age  sex_code
0  79571.29901   73.89    0  white  16   49         0
1  96396.98864   66.23    1  white  16   62         1
2  48710.66695   63.77    1  white  16   33         1
3  80478.09615   63.22    1  other  16   95         1
4  82089.34550   63.08    1  white  17   43         1

In [62]:
df.drop("sex_code", axis=1, inplace=True)
df

              earn  height  sex   race  ed  age
0     79571.299010   73.89    0  white  16   49
1     96396.988640   66.23    1  white  16   62
2     48710.666950   63.77    1  white  16   33
3     80478.096150   63.22    1  other  16   95
4     82089.345500   63.08    1  white  17   43
...            ...     ...  ...    ...  ..  ...
1374  30173.380360   71.68    0  white  12   33
1375  24853.519510   61.31    1  white  18   86
1376  13710.671310   63.64    1  white  12   37
1377  95426.014410   71.65    0  white  12   54
1378   9575.461857   68.22    0  white  12   31

[1379 rows x 6 columns]

In [63]:
# apply for dataframe

# map 과 달리, series 전체(column) 에 해당 함수를 적용
# 입력 값이 series 데이터로 입력 받아 handling 가능

In [64]:
df_info = df[["earn", "height", "age"]]
df_info.head()

          earn  height  age
0  79571.29901   73.89   49
1  96396.98864   66.23   62
2  48710.66695   63.77   33
3  80478.09615   63.22   95
4  82089.34550   63.08   43

In [65]:
# 각 column 별로 결과값 반환
f = lambda x: x.max() - x.min()
df_info.apply(f)

earn      318047.708489
height        19.870000
age           73.000000
dtype: float64

In [66]:
# 내장 연산 함수를 사용할 때도 똑같은 효과
# mean, std 등

In [67]:
df_info.sum()

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [68]:
df_info.apply(sum)

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [69]:
# scalar 값 이외에 series 값의 반환도 가능

def f(x):
    return Series([x.min(), x.max()], index=["min", "max"])

df_info.apply(f)

              earn  height  age
min     -98.580489   57.34   22
max  317949.128000   77.21   95

In [70]:
# series 단위가 아닌 elemnet 단위로 함수를 적용
# series 단위에 apply 를 적용시킬때와 같은 효과

In [71]:
f = lambda x: -x
df_info.applymap(f).head() # 모든 값에 다 적용이 된다

          earn  height  age
0 -79571.29901  -73.89  -49
1 -96396.98864  -66.23  -62
2 -48710.66695  -63.77  -33
3 -80478.09615  -63.22  -95
4 -82089.34550  -63.08  -43

In [72]:
f = lambda x: -x
df_info["earn"].apply(f).head() # series 단위로 적용

0   -79571.29901
1   -96396.98864
2   -48710.66695
3   -80478.09615
4   -82089.34550
Name: earn, dtype: float64

In [74]:
def f(x):
    return Series(
        [x.min(), x.max(), x.mean(), sum(x.isnull())],
        index=["min", "max", "mean", "null"]
    )

df_info.apply(f)

               earn    height        age
min      -98.580489  57.34000  22.000000
max   317949.128000  77.21000  95.000000
mean   32446.292622  66.59264  45.328499
null       0.000000   0.00000   0.000000

In [75]:
# Pandas built-in funtions

In [76]:
# describe

# Numeric type 데이터의 요약 정보를 보여줌

In [77]:
df.head()

          earn  height  sex   race  ed  age
0  79571.29901   73.89    0  white  16   49
1  96396.98864   66.23    1  white  16   62
2  48710.66695   63.77    1  white  16   33
3  80478.09615   63.22    1  other  16   95
4  82089.34550   63.08    1  white  17   43

In [78]:
df.describe()

                earn       height          sex           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640     0.622915    13.354605    45.328499
std     31257.070007     3.818108     0.484832     2.438741    15.789715
min       -98.580489    57.340000     0.000000     3.000000    22.000000
25%     10538.790720    63.720000     0.000000    12.000000    33.000000
50%     26877.870180    66.050000     1.000000    13.000000    42.000000
75%     44506.215340    69.315000     1.000000    15.000000    55.000000
max    317949.128000    77.210000     1.000000    18.000000    95.000000

In [79]:
# unique

# series data 의 유일한 값을 list 로 반환

In [80]:
df.race.unique() # 유일한 인종의 값

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [82]:
# dict type 으로 index
np.array(dict(enumerate(df["race"].unique())))

array({0: 'white', 1: 'other', 2: 'hispanic', 3: 'black'}, dtype=object)

In [83]:
# label index 값과 label 값 각각 추출
value = list(
    map(
        int, np.array(list(enumerate(df["race"].unique())))[: , 0].tolist()
    )
)

key = np.array(list(enumerate(df["race"].unique())), dtype=str)[:, 1].tolist()

value, key

([0, 1, 2, 3], ['white', 'other', 'hispanic', 'black'])

In [84]:
# sum

# 기본적인 column 또는 row 값의 연산을 지원
# sub, mean, nin, max, count, median, mad, var 등

In [85]:
df.sum(axis=0) # column 별

earn                                        44743437.525586
height                                             91831.25
sex                                                     859
race      whitewhitewhiteotherwhitewhitewhitewhitehispan...
ed                                                    18416
age                                                   62508
dtype: object

In [86]:
df.sum(axis= 1) # row 별

C:\Users\gih54\AppData\Local\Temp\ipykernel_2224\1910978020.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(axis= 1) # row 별

0       79710.189010
1       96542.218640
2       48824.436950
3       80653.316150
4       82213.425500
            ...
1374    30290.060360
1375    25019.829510
1376    13824.311310
1377    95563.664410
1378     9686.681857
Length: 1379, dtype: float64

In [ ]:
# isnull

# column 또는 row 값이 NaN (null) 값의 index 를 반환

In [88]:
df.isnull().head()

    earn  height    sex   race     ed    age
0  False   False  False  False  False  False
1  False   False  False  False  False  False
2  False   False  False  False  False  False
3  False   False  False  False  False  False
4  False   False  False  False  False  False

In [89]:
df.isnull().sum() # Null 인 값의 합

earn      0
height    0
sex       0
race      0
ed        0
age       0
dtype: int64

In [90]:
# sort_values

# column 값을 기준으로 데이터를 sorting

In [92]:
df.sort_values(["age", "earn"], ascending=True).head() # ascending : 오름차순

             earn  height  sex      race  ed  age
1038   -56.321979   67.81    0  hispanic  10   22
800    -27.876819   72.29    0     white  12   22
963    -25.655260   68.90    0     white  12   22
1105   988.565070   64.71    1     white  12   22
801   1000.221504   64.09    1     white  12   22

In [93]:
# Correlation & Covariance

# 상관계수와 공분산을 구하는 함수
# corr, cov, corrwith

In [94]:
df.age.corr(df.earn)

0.07400349178196389

In [95]:
df.age.cov(df.earn) # 공분산

36523.6992132012

In [96]:
df.corrwith(df.earn)

earn      1.000000
height    0.291600
sex      -0.337328
ed        0.350374
age       0.074003
dtype: float64

In [97]:
df.corr() # 모든 column 간의 상관관계

            earn    height       sex        ed       age
earn    1.000000  0.291600 -0.337328  0.350374  0.074003
height  0.291600  1.000000 -0.703672  0.114047 -0.133727
sex    -0.337328 -0.703672  1.000000 -0.061747  0.070036
ed      0.350374  0.114047 -0.061747  1.000000 -0.129802
age     0.074003 -0.133727  0.070036 -0.129802  1.000000